test_app/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "When the Green Woods Laugh"], ["description", "Consectetur voluptate ut. Modi eum iure. Iure vel ipsam."], ["updated_at", "2020-11-02 21:03:18.590378"], ["id", 13]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)